neuroscience-faculty-placements.org
#+TITLE: Neuroscience faculty placements and school rankings

* Introduction
Faculty placement statistics in neuroscience are very hard to come by,
even though this is extremely useful information in choosing schools
or estimating chances at a given school.

Most programs don't have a clearly visible list of faculty placements,
and professors don't always keep track of alumni placements or may too
young to have placed any students. Aspiring neuroscience students and
post-docs, then, are often left to estimate their chances based on the
perceived prestige of their school, a notoriously ambiguous metric.

This is made harder by the fact that the rankings are not consistent.
For instance, [[https://www.chronicle.com/article/NRC-Rankings-Overview-/124747][The Chronicle NRC rankings]] lists Brandeis and Caltech as
top 10 by academic research, but the [[https://www.usnews.com/education/best-global-universities/search?country=united-states&subject=neuroscience-behavior&name=][US News ranking]] lists both as
below top 50. Neither Princeton nor Carnegie Mellon are even listed in
the NRC rankings, even though both are top-notch neuroscience research
schools.

Fortunately, people have been cataloging neuroscience students and
faculty on [[https://neurotree.org][Neurotree]], along with PhD and post-doc positions. This
allows us to estimate faculty placement rates for each university.

* Methodology
I scraped all the people associated with a list of schools. To determine
whether someone is a professor, I check that they have at least one grad
student listed (this can exclude some newer professors, placing them
in "PhD unclear" category).

Since people who completed a PhD but did not obtain a faculty position
tend to be unlisted, I normalized the number of PhD students placed by all PhD
(placed and unclear) and number of professors listed at institution
(as another proxy for size).

Ratio = PhD placed / (PhD placed + PhD unclear + Professors listed)

This ratio is my current best estimate of the faculty placement rate.
Depending on the amount and type of missing data on neurotree, this
could be either an overestimate or underestimate (mostly depending on
how many unplaced PhD students are listed).

