docs/neuroscience-faculty-placements/index.html
<?xml version="1.0" encoding="utf-8"?><!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html lang="en" xml:lang="en" xmlns="http://www.w3.org/1999/xhtml">
<head>
<!-- 2020-08-16 Sun 14:08 -->
<meta content="text/html;charset=utf-8" http-equiv="Content-Type"/>
<meta content="width=device-width, initial-scale=1" name="viewport"/>
<title>Neuroscience faculty placements and school rankings</title>
<meta content="Org mode" name="generator"/>
<meta content="lambdaloop" name="author"/>
<link href="/css/code-theme.css" rel="stylesheet"/>
<link href="/css/style.css" rel="stylesheet"/>
</head>
<body>
<div id="content">
<h1 class="title">Neuroscience faculty placements and school rankings</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org08869b9">1. Introduction</a></li>
<li><a href="#orge586a8b">2. Methodology</a></li>
<li><a href="#orgc0b7d09">3. PhD placement rankings</a></li>
<li><a href="#org8156d7d">4. Postdoc placement rankings</a></li>
</ul>
</div>
</div>
<div class="outline-2" id="outline-container-org08869b9">
<h2 id="org08869b9"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Faculty placement statistics in neuroscience are very hard to come by,
even though this is extremely useful information in choosing schools
or estimating chances at a given school.
</p>
<p>
Most programs don’t have a clearly visible list of faculty placements,
and professors don’t always keep track of alumni placements or may too
young to have placed any students. Aspiring neuroscience students and
post-docs, then, are often left to estimate their chances based on the
perceived prestige of their school, a notoriously ambiguous metric.
</p>
<p>
This is made harder by the fact that the rankings are not consistent.
For instance, <a href="https://www.chronicle.com/article/NRC-Rankings-Overview-/124747">The Chronicle NRC rankings</a> lists Brandeis and Caltech as
top 10 by academic research, but the <a href="https://www.usnews.com/education/best-global-universities/search?country=united-states&amp;subject=neuroscience-behavior&amp;name=">US News ranking</a> lists both as
below top 50. Neither Princeton nor Carnegie Mellon are even listed in
the NRC rankings, even though both are top-notch neuroscience research
schools.
</p>
<p>
Fortunately, people have been cataloging neuroscience students and
faculty on <a href="https://neurotree.org">Neurotree</a>, along with PhD and post-doc positions. This
allows us to estimate faculty placement rates for each university.
</p>
</div>
</div>
<div class="outline-2" id="outline-container-orge586a8b">
<h2 id="orge586a8b"><span class="section-number-2">2</span> Methodology</h2>
<div class="outline-text-2" id="text-2">
<p>
I scraped all the people associated with a list of schools. To determine
whether someone is a professor, I check that they have at least one grad
student listed (this can exclude some newer professors, placing them
in “PhD unclear” category).
</p>
<p>
Since people who completed a PhD but did not obtain a faculty position
tend to be unlisted, I normalized the number of PhD students placed by all PhD
(placed and unclear) and number of professors listed at institution
(as another proxy for size).
</p>
<p>
Ratio = PhD placed / (PhD placed + PhD unclear + Professors listed)
</p>
<p>
This ratio is my current best estimate of the faculty placement rate.
Depending on the amount and type of missing data on neurotree, this
could be either an overestimate or underestimate (mostly depending on
how many unplaced PhD students are listed).
</p>
<p>
You can find the code for computing these tables along with brief
instructions here: <a href="https://github.com/lambdaloop/neurotree-scrape">https://github.com/lambdaloop/neurotree-scrape</a>
</p>
</div>
</div>
