neuroscience-faculty-placements.org
* PhD placement rankings
Here is the table. Only schools with at least 20 listed PhDs placed
are listed. Only a select set of schools outside America are listed
for comparison, as I didn't try to do a thorough listing of these
(most have few people in neurotree anyhow).


| Institution                  | Ratio | PhD placed | PhD unclear | Professors listed |
|------------------------------+-------+------------+-------------+-------------------|
| ANU                          | 0.389 |         21 |          11 |                22 |
| Johns Hopkins                | 0.369 |         93 |          59 |               100 |
| MIT                          | 0.368 |        175 |          77 |               224 |
| Rockefeller                  | 0.357 |         55 |          26 |                73 |
| Oxford                       | 0.320 |        126 |          68 |               200 |
| Cambridge                    | 0.314 |         89 |          48 |               146 |
| Harvard Medical School       | 0.286 |         52 |          50 |                80 |
| Brown                        | 0.250 |         85 |          50 |               205 |
| Hebrew University            | 0.250 |         32 |          17 |                79 |
| Harvard                      | 0.245 |        248 |          85 |               678 |
| Johns Hopkins Medical School | 0.242 |         29 |          21 |                70 |
| UCL                          | 0.240 |         88 |          68 |               211 |
| Stanford                     | 0.233 |        222 |          95 |               636 |
| Edinburgh                    | 0.228 |         29 |          21 |                77 |
| Caltech                      | 0.218 |         83 |          33 |               264 |
| Princeton                    | 0.213 |         63 |          46 |               187 |
| Rutgers                      | 0.207 |         31 |          25 |                94 |
| Yale                         | 0.198 |        158 |          89 |               551 |
| UC Berkeley                  | 0.194 |        209 |         102 |               769 |
| Concordia                    | 0.185 |         22 |          15 |                82 |
| Chicago                      | 0.184 |        125 |          79 |               474 |
| Penn                         | 0.179 |        157 |          94 |               624 |
| Cornell                      | 0.177 |         69 |          48 |               272 |
| McGill                       | 0.169 |         95 |          66 |               401 |
| Carnegie Mellon              | 0.162 |         44 |          35 |               192 |
| Michigan, Ann Arbor          | 0.162 |        165 |         106 |               748 |
| Syracuse                     | 0.151 |         24 |          10 |               125 |
| Columbia                     | 0.143 |        146 |          95 |               783 |
| Rochester                    | 0.140 |         59 |          43 |               318 |
| UCSF                         | 0.138 |         66 |          56 |               355 |
| University of Washington     | 0.136 |        109 |          87 |               606 |
| University of Iowa           | 0.132 |         70 |          65 |               395 |
| Dartmouth                    | 0.130 |         21 |          29 |               112 |
| University of Oregon         | 0.129 |         36 |          26 |               216 |
| Baylor                       | 0.124 |         25 |          30 |               147 |
| UW Madison                   | 0.123 |        113 |          90 |               712 |
| Duke                         | 0.121 |         72 |          62 |               462 |
| UCSD                         | 0.118 |        119 |          87 |               799 |
| Indiana University           | 0.116 |         78 |          60 |               536 |
| UCLA                         | 0.115 |        138 |         123 |               934 |
| Brandeis                     | 0.112 |         26 |          13 |               194 |
| OHSU                         | 0.111 |         20 |          37 |               123 |
| CU Boulder                   | 0.109 |         38 |          40 |               272 |
| UIUC                         | 0.109 |         65 |          46 |               488 |
| Case Western                 | 0.108 |         30 |          28 |               220 |
| UVA                          | 0.103 |         51 |          40 |               404 |
| University of Toronto        | 0.103 |         74 |          67 |               578 |
| U Mass Amherst               | 0.101 |         34 |          35 |               266 |
| UC Irvine                    | 0.098 |         55 |          55 |               450 |
| UMN                          | 0.098 |         94 |          79 |               790 |
| Michigan State               | 0.094 |         41 |          43 |               353 |
| SUNY Stony Brook             | 0.093 |         33 |          30 |               291 |
| Ohio State                   | 0.092 |         48 |          46 |               426 |
| Washington University        | 0.092 |         54 |          49 |               483 |
| Vanderbilt                   | 0.089 |         45 |          50 |               408 |
| University of Arizona        | 0.080 |         35 |          27 |               375 |
| University of Utah           | 0.077 |         28 |          33 |               302 |
| UC Davis                     | 0.075 |         40 |          63 |               430 |
| Purdue                       | 0.075 |         34 |          41 |               379 |
| UNC Chapel Hill              | 0.073 |         55 |          53 |               642 |
| Penn State                   | 0.072 |         41 |          39 |               487 |
| Florida State                | 0.071 |         28 |          24 |               345 |
| Northwestern                 | 0.069 |         57 |          72 |               701 |
| University of Maryland       | 0.068 |         38 |          36 |               482 |
| University of Florida        | 0.068 |         50 |          50 |               634 |
| UT Austin                    | 0.066 |         57 |          59 |               743 |
| NYU                          | 0.064 |         53 |          55 |               715 |
| USC                          | 0.059 |         48 |          44 |               723 |
| Emory                        | 0.056 |         27 |          54 |               397 |
| Boston University            | 0.056 |         39 |          55 |               597 |
| Université de Montréal       | 0.053 |         20 |          36 |               319 |
| University of Pittsburgh     | 0.053 |         31 |          68 |               487 |


