docs/neuroscience-faculty-placements/index.html
<div class="outline-2" id="outline-container-orgc0b7d09">
<h2 id="orgc0b7d09"><span class="section-number-2">3</span> PhD placement rankings</h2>
<div class="outline-text-2" id="text-3">
<p>
Here is the table. Only schools with at least 20 listed PhDs placed
are listed. Only a select set of schools outside America are listed
for comparison, as I didn’t try to do a thorough listing of these
(most have few people in neurotree anyhow).
</p>
<table border="2" cellpadding="6" cellspacing="0" frame="hsides" rules="groups">
<colgroup>
<col class="org-left"/>
<col class="org-right"/>
<col class="org-right"/>
<col class="org-right"/>
<col class="org-right"/>
</colgroup>
<thead>
<tr>
<th class="org-left" scope="col">Institution</th>
<th class="org-right" scope="col">Ratio</th>
<th class="org-right" scope="col">PhD placed</th>
<th class="org-right" scope="col">PhD unclear</th>
<th class="org-right" scope="col">Professors listed</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">ANU</td>
<td class="org-right">0.389</td>
<td class="org-right">21</td>
<td class="org-right">11</td>
<td class="org-right">22</td>
</tr>
<tr>
<td class="org-left">Johns Hopkins</td>
<td class="org-right">0.369</td>
<td class="org-right">93</td>
<td class="org-right">59</td>
<td class="org-right">100</td>
</tr>
<tr>
<td class="org-left">MIT</td>
<td class="org-right">0.368</td>
<td class="org-right">175</td>
<td class="org-right">77</td>
<td class="org-right">224</td>
</tr>
<tr>
<td class="org-left">Rockefeller</td>
<td class="org-right">0.357</td>
<td class="org-right">55</td>
<td class="org-right">26</td>
<td class="org-right">73</td>
</tr>
<tr>
<td class="org-left">Oxford</td>
<td class="org-right">0.320</td>
<td class="org-right">126</td>
<td class="org-right">68</td>
<td class="org-right">200</td>
</tr>
<tr>
<td class="org-left">Cambridge</td>
<td class="org-right">0.314</td>
<td class="org-right">89</td>
<td class="org-right">48</td>
<td class="org-right">146</td>
</tr>
<tr>
<td class="org-left">Harvard Medical School</td>
<td class="org-right">0.286</td>
<td class="org-right">52</td>
<td class="org-right">50</td>
<td class="org-right">80</td>
</tr>
<tr>
<td class="org-left">Brown</td>
<td class="org-right">0.250</td>
<td class="org-right">85</td>
<td class="org-right">50</td>
<td class="org-right">205</td>
</tr>
<tr>
<td class="org-left">Hebrew University</td>
<td class="org-right">0.250</td>
<td class="org-right">32</td>
<td class="org-right">17</td>
<td class="org-right">79</td>
</tr>
<tr>
<td class="org-left">Harvard</td>
<td class="org-right">0.245</td>
<td class="org-right">248</td>
<td class="org-right">85</td>
<td class="org-right">678</td>
</tr>
<tr>
<td class="org-left">Johns Hopkins Medical School</td>
<td class="org-right">0.242</td>
<td class="org-right">29</td>
<td class="org-right">21</td>
<td class="org-right">70</td>
</tr>
<tr>
<td class="org-left">UCL</td>
<td class="org-right">0.240</td>
<td class="org-right">88</td>
<td class="org-right">68</td>
<td class="org-right">211</td>
</tr>
<tr>
<td class="org-left">Stanford</td>
<td class="org-right">0.233</td>
<td class="org-right">222</td>
<td class="org-right">95</td>
<td class="org-right">636</td>
</tr>
<tr>
<td class="org-left">Edinburgh</td>
<td class="org-right">0.228</td>
<td class="org-right">29</td>
<td class="org-right">21</td>
<td class="org-right">77</td>
</tr>
<tr>
<td class="org-left">Caltech</td>
<td class="org-right">0.218</td>
<td class="org-right">83</td>
<td class="org-right">33</td>
<td class="org-right">264</td>
</tr>
<tr>
<td class="org-left">Princeton</td>
<td class="org-right">0.213</td>
<td class="org-right">63</td>
<td class="org-right">46</td>
<td class="org-right">187</td>
</tr>
<tr>
<td class="org-left">Rutgers</td>
<td class="org-right">0.207</td>
<td class="org-right">31</td>
<td class="org-right">25</td>
<td class="org-right">94</td>
</tr>
<tr>
<td class="org-left">Yale</td>
<td class="org-right">0.198</td>
<td class="org-right">158</td>
<td class="org-right">89</td>
<td class="org-right">551</td>
</tr>
<tr>
<td class="org-left">UC Berkeley</td>
<td class="org-right">0.194</td>
<td class="org-right">209</td>
<td class="org-right">102</td>
<td class="org-right">769</td>
</tr>
<tr>
<td class="org-left">Concordia</td>
<td class="org-right">0.185</td>
<td class="org-right">22</td>
<td class="org-right">15</td>
<td class="org-right">82</td>
</tr>
<tr>
<td class="org-left">Chicago</td>
<td class="org-right">0.184</td>
<td class="org-right">125</td>
<td class="org-right">79</td>
<td class="org-right">474</td>
</tr>
<tr>
<td class="org-left">Penn</td>
<td class="org-right">0.179</td>
<td class="org-right">157</td>
<td class="org-right">94</td>
<td class="org-right">624</td>
</tr>
<tr>
<td class="org-left">Cornell</td>
<td class="org-right">0.177</td>
<td class="org-right">69</td>
<td class="org-right">48</td>
<td class="org-right">272</td>
</tr>
<tr>
<td class="org-left">McGill</td>
<td class="org-right">0.169</td>
<td class="org-right">95</td>
<td class="org-right">66</td>
<td class="org-right">401</td>
</tr>
<tr>
<td class="org-left">Carnegie Mellon</td>
<td class="org-right">0.162</td>
<td class="org-right">44</td>
<td class="org-right">35</td>
<td class="org-right">192</td>
</tr>
<tr>
<td class="org-left">Michigan, Ann Arbor</td>
<td class="org-right">0.162</td>
<td class="org-right">165</td>
<td class="org-right">106</td>
<td class="org-right">748</td>
</tr>
<tr>
<td class="org-left">Syracuse</td>
<td class="org-right">0.151</td>
<td class="org-right">24</td>
<td class="org-right">10</td>
<td class="org-right">125</td>
</tr>
<tr>
<td class="org-left">Columbia</td>
<td class="org-right">0.143</td>
<td class="org-right">146</td>
<td class="org-right">95</td>
<td class="org-right">783</td>
</tr>
<tr>
<td class="org-left">Rochester</td>
<td class="org-right">0.140</td>
<td class="org-right">59</td>
<td class="org-right">43</td>
<td class="org-right">318</td>
</tr>
<tr>
<td class="org-left">UCSF</td>
<td class="org-right">0.138</td>
<td class="org-right">66</td>
<td class="org-right">56</td>
<td class="org-right">355</td>
</tr>
<tr>
<td class="org-left">University of Washington</td>
<td class="org-right">0.136</td>
<td class="org-right">109</td>
<td class="org-right">87</td>
<td class="org-right">606</td>
</tr>
<tr>
<td class="org-left">University of Iowa</td>
<td class="org-right">0.132</td>
<td class="org-right">70</td>
<td class="org-right">65</td>
<td class="org-right">395</td>
</tr>
<tr>
<td class="org-left">Dartmouth</td>
<td class="org-right">0.130</td>
<td class="org-right">21</td>
<td class="org-right">29</td>
<td class="org-right">112</td>
</tr>
<tr>
<td class="org-left">University of Oregon</td>
<td class="org-right">0.129</td>
<td class="org-right">36</td>
<td class="org-right">26</td>
<td class="org-right">216</td>
</tr>
<tr>
<td class="org-left">Baylor</td>
<td class="org-right">0.124</td>
<td class="org-right">25</td>
<td class="org-right">30</td>
<td class="org-right">147</td>
</tr>
<tr>
<td class="org-left">UW Madison</td>
<td class="org-right">0.123</td>
<td class="org-right">113</td>
<td class="org-right">90</td>
<td class="org-right">712</td>
</tr>
<tr>
<td class="org-left">Duke</td>
<td class="org-right">0.121</td>
<td class="org-right">72</td>
<td class="org-right">62</td>
<td class="org-right">462</td>
</tr>
<tr>
<td class="org-left">UCSD</td>
<td class="org-right">0.118</td>
<td class="org-right">119</td>
<td class="org-right">87</td>
<td class="org-right">799</td>
</tr>
<tr>
<td class="org-left">Indiana University</td>
<td class="org-right">0.116</td>
<td class="org-right">78</td>
<td class="org-right">60</td>
<td class="org-right">536</td>
</tr>
<tr>
<td class="org-left">UCLA</td>
<td class="org-right">0.115</td>
<td class="org-right">138</td>
<td class="org-right">123</td>
<td class="org-right">934</td>
</tr>
<tr>
<td class="org-left">Brandeis</td>
<td class="org-right">0.112</td>
<td class="org-right">26</td>
<td class="org-right">13</td>
<td class="org-right">194</td>
</tr>
<tr>
<td class="org-left">OHSU</td>
<td class="org-right">0.111</td>
<td class="org-right">20</td>
<td class="org-right">37</td>
<td class="org-right">123</td>
</tr>
<tr>
<td class="org-left">CU Boulder</td>
<td class="org-right">0.109</td>
<td class="org-right">38</td>
<td class="org-right">40</td>
<td class="org-right">272</td>
</tr>
<tr>
<td class="org-left">UIUC</td>
<td class="org-right">0.109</td>
<td class="org-right">65</td>
<td class="org-right">46</td>
<td class="org-right">488</td>
</tr>
<tr>
<td class="org-left">Case Western</td>
<td class="org-right">0.108</td>
<td class="org-right">30</td>
<td class="org-right">28</td>
<td class="org-right">220</td>
</tr>
<tr>
<td class="org-left">UVA</td>
<td class="org-right">0.103</td>
<td class="org-right">51</td>
<td class="org-right">40</td>
<td class="org-right">404</td>
</tr>
<tr>
<td class="org-left">University of Toronto</td>
<td class="org-right">0.103</td>
<td class="org-right">74</td>
<td class="org-right">67</td>
<td class="org-right">578</td>
</tr>
<tr>
<td class="org-left">U Mass Amherst</td>
<td class="org-right">0.101</td>
<td class="org-right">34</td>
<td class="org-right">35</td>
<td class="org-right">266</td>
</tr>
<tr>
<td class="org-left">UC Irvine</td>
<td class="org-right">0.098</td>
<td class="org-right">55</td>
<td class="org-right">55</td>
<td class="org-right">450</td>
</tr>
<tr>
<td class="org-left">UMN</td>
<td class="org-right">0.098</td>
<td class="org-right">94</td>
<td class="org-right">79</td>
<td class="org-right">790</td>
</tr>
<tr>
<td class="org-left">Michigan State</td>
<td class="org-right">0.094</td>
<td class="org-right">41</td>
<td class="org-right">43</td>
<td class="org-right">353</td>
</tr>
<tr>
<td class="org-left">SUNY Stony Brook</td>
<td class="org-right">0.093</td>
<td class="org-right">33</td>
<td class="org-right">30</td>
<td class="org-right">291</td>
</tr>
<tr>
<td class="org-left">Ohio State</td>
<td class="org-right">0.092</td>
<td class="org-right">48</td>
<td class="org-right">46</td>
<td class="org-right">426</td>
</tr>
<tr>
<td class="org-left">Washington University</td>
<td class="org-right">0.092</td>
<td class="org-right">54</td>
<td class="org-right">49</td>
<td class="org-right">483</td>
</tr>
<tr>
<td class="org-left">Vanderbilt</td>
<td class="org-right">0.089</td>
<td class="org-right">45</td>
<td class="org-right">50</td>
<td class="org-right">408</td>
</tr>
<tr>
<td class="org-left">University of Arizona</td>
<td class="org-right">0.080</td>
<td class="org-right">35</td>
<td class="org-right">27</td>
<td class="org-right">375</td>
</tr>
<tr>
<td class="org-left">University of Utah</td>
<td class="org-right">0.077</td>
<td class="org-right">28</td>
<td class="org-right">33</td>
<td class="org-right">302</td>
</tr>
<tr>
<td class="org-left">UC Davis</td>
<td class="org-right">0.075</td>
<td class="org-right">40</td>
<td class="org-right">63</td>
<td class="org-right">430</td>
</tr>
<tr>
<td class="org-left">Purdue</td>
<td class="org-right">0.075</td>
<td class="org-right">34</td>
<td class="org-right">41</td>
<td class="org-right">379</td>
</tr>
<tr>
<td class="org-left">UNC Chapel Hill</td>
<td class="org-right">0.073</td>
<td class="org-right">55</td>
<td class="org-right">53</td>
<td class="org-right">642</td>
</tr>
<tr>
<td class="org-left">Penn State</td>
<td class="org-right">0.072</td>
<td class="org-right">41</td>
<td class="org-right">39</td>
<td class="org-right">487</td>
</tr>
<tr>
<td class="org-left">Florida State</td>
<td class="org-right">0.071</td>
<td class="org-right">28</td>
<td class="org-right">24</td>
<td class="org-right">345</td>
</tr>
<tr>
<td class="org-left">Northwestern</td>
<td class="org-right">0.069</td>
<td class="org-right">57</td>
<td class="org-right">72</td>
<td class="org-right">701</td>
</tr>
<tr>
<td class="org-left">University of Maryland</td>
<td class="org-right">0.068</td>
<td class="org-right">38</td>
<td class="org-right">36</td>
<td class="org-right">482</td>
</tr>
<tr>
<td class="org-left">University of Florida</td>
<td class="org-right">0.068</td>
<td class="org-right">50</td>
<td class="org-right">50</td>
<td class="org-right">634</td>
</tr>
<tr>
<td class="org-left">UT Austin</td>
<td class="org-right">0.066</td>
<td class="org-right">57</td>
<td class="org-right">59</td>
<td class="org-right">743</td>
</tr>
<tr>
<td class="org-left">NYU</td>
<td class="org-right">0.064</td>
<td class="org-right">53</td>
<td class="org-right">55</td>
<td class="org-right">715</td>
</tr>
<tr>
<td class="org-left">USC</td>
<td class="org-right">0.059</td>
<td class="org-right">48</td>
<td class="org-right">44</td>
<td class="org-right">723</td>
</tr>
<tr>
<td class="org-left">Emory</td>
<td class="org-right">0.056</td>
<td class="org-right">27</td>
<td class="org-right">54</td>
<td class="org-right">397</td>
</tr>
<tr>
<td class="org-left">Boston University</td>
<td class="org-right">0.056</td>
<td class="org-right">39</td>
<td class="org-right">55</td>
<td class="org-right">597</td>
</tr>
<tr>
<td class="org-left">Université de Montréal</td>
<td class="org-right">0.053</td>
<td class="org-right">20</td>
<td class="org-right">36</td>
<td class="org-right">319</td>
</tr>
<tr>
<td class="org-left">University of Pittsburgh</td>
<td class="org-right">0.053</td>
<td class="org-right">31</td>
<td class="org-right">68</td>
<td class="org-right">487</td>
</tr>
</tbody>
</table>
</div>
</div>
