neuroscience-faculty-placements.org
* Postdoc placement rankings
With the data from neurotree, we can also compute a
similar table but for post-doctorates, for which rankings are very
hard to find. Interestingly, this list is a bit different from the PhD
faculty placement rates.

| Institution                  | Ratio | Post-docs placed | Post-docs unclear | Professors listed |
|------------------------------+-------+------------------+-------------------+-------------------|
| Caltech                      | 0.537 |              116 |                23 |                77 |
| Rockefeller                  | 0.535 |              114 |                20 |                79 |
| NIMH                         | 0.500 |               76 |                13 |                63 |
| NYU School of Medicine       | 0.438 |               21 |                10 |                17 |
| Harvard                      | 0.428 |              151 |                50 |               152 |
| Cambridge                    | 0.423 |               60 |                25 |                57 |
| Salk Institute               | 0.407 |               88 |                24 |               104 |
| MGH                          | 0.393 |               22 |                15 |                19 |
| MIT                          | 0.392 |              155 |                37 |               203 |
| UC Berkeley                  | 0.390 |              120 |                49 |               139 |
| Johns Hopkins                | 0.389 |               65 |                36 |                66 |
| Yale School of Medicine      | 0.387 |               24 |                18 |                20 |
| Harvard Medical School       | 0.374 |              145 |                59 |               184 |
| Stanford                     | 0.372 |              186 |                62 |               252 |
| NIH                          | 0.367 |               66 |                26 |                88 |
| Carnegie Mellon              | 0.362 |               21 |                14 |                23 |
| UCSD                         | 0.359 |              111 |                68 |               130 |
| Oxford                       | 0.358 |               64 |                51 |                64 |
| University of Arizona        | 0.348 |               23 |                21 |                22 |
| CSHL                         | 0.347 |               33 |                13 |                49 |
| CU Boulder                   | 0.333 |               27 |                20 |                34 |
| UCSF                         | 0.333 |              160 |                58 |               263 |
| Washington University        | 0.331 |               58 |                38 |                79 |
| UCL                          | 0.329 |               92 |                52 |               136 |
| UVA                          | 0.328 |               20 |                20 |                21 |
| Columbia                     | 0.323 |              106 |                52 |               170 |
| Princeton                    | 0.308 |               44 |                25 |                74 |
| Yale                         | 0.307 |               95 |                51 |               163 |
| UW Madison                   | 0.300 |               51 |                50 |                69 |
| University of Iowa           | 0.296 |               21 |                28 |                22 |
| UCLA                         | 0.294 |              112 |                76 |               193 |
| NYU                          | 0.287 |               64 |                40 |               119 |
| Cornell                      | 0.287 |               35 |                23 |                64 |
| Vanderbilt                   | 0.287 |               49 |                45 |                77 |
| UMN                          | 0.282 |               31 |                37 |                42 |
| Brandeis                     | 0.282 |               20 |                13 |                38 |
| University of Washington     | 0.278 |               79 |                64 |               141 |
| SUNY Stony Brook             | 0.278 |               20 |                19 |                33 |
| Rochester                    | 0.276 |               35 |                37 |                55 |
| Rutgers                      | 0.276 |               27 |                25 |                46 |
| UC Irvine                    | 0.273 |               39 |                34 |                70 |
| Duke                         | 0.271 |               61 |                44 |               120 |
| Baylor                       | 0.263 |               46 |                34 |                95 |
| Johns Hopkins Medical School | 0.260 |               45 |                26 |               102 |
| Indiana University           | 0.250 |               23 |                24 |                45 |
| Boston University            | 0.243 |               25 |                30 |                48 |
| Chicago                      | 0.239 |               33 |                40 |                65 |
| Penn                         | 0.239 |               78 |                67 |               182 |
| Brown                        | 0.232 |               32 |                41 |                65 |
| OHSU                         | 0.231 |               39 |                34 |                96 |
| University of Florida        | 0.225 |               20 |                26 |                43 |
| McGill                       | 0.219 |               35 |                44 |                81 |
| UNC Chapel Hill              | 0.212 |               36 |                43 |                91 |
| Michigan, Ann Arbor          | 0.200 |               33 |                55 |                77 |
| University of Toronto        | 0.191 |               21 |                44 |                45 |
| UC Davis                     | 0.189 |               32 |                48 |                89 |
| Northwestern                 | 0.173 |               37 |                48 |               129 |
| University of Pittsburgh     | 0.166 |               35 |                49 |               127 |
| Emory                        | 0.145 |               21 |                42 |                82 |

You can find the code for computing these table along with brief
instructions here: https://github.com/lambdaloop/neurotree-scrape
