docs/neuroscience-faculty-placements/index.html
<div class="outline-2" id="outline-container-org8156d7d">
<h2 id="org8156d7d"><span class="section-number-2">4</span> Postdoc placement rankings</h2>
<div class="outline-text-2" id="text-4">
<p>
With the data from neurotree, we can also compute a
similar table but for post-doctorates, for which rankings are very
hard to find. Interestingly, this list is a bit different from the PhD
faculty placement rates.
</p>
<table border="2" cellpadding="6" cellspacing="0" frame="hsides" rules="groups">
<colgroup>
<col class="org-left"/>
<col class="org-right"/>
<col class="org-right"/>
<col class="org-right"/>
<col class="org-right"/>
</colgroup>
<thead>
<tr>
<th class="org-left" scope="col">Institution</th>
<th class="org-right" scope="col">Ratio</th>
<th class="org-right" scope="col">Post-docs placed</th>
<th class="org-right" scope="col">Post-docs unclear</th>
<th class="org-right" scope="col">Professors listed</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Caltech</td>
<td class="org-right">0.537</td>
<td class="org-right">116</td>
<td class="org-right">23</td>
<td class="org-right">77</td>
</tr>
<tr>
<td class="org-left">Rockefeller</td>
<td class="org-right">0.535</td>
<td class="org-right">114</td>
<td class="org-right">20</td>
<td class="org-right">79</td>
</tr>
<tr>
<td class="org-left">NIMH</td>
<td class="org-right">0.500</td>
<td class="org-right">76</td>
<td class="org-right">13</td>
<td class="org-right">63</td>
</tr>
<tr>
<td class="org-left">NYU School of Medicine</td>
<td class="org-right">0.438</td>
<td class="org-right">21</td>
<td class="org-right">10</td>
<td class="org-right">17</td>
</tr>
<tr>
<td class="org-left">Harvard</td>
<td class="org-right">0.428</td>
<td class="org-right">151</td>
<td class="org-right">50</td>
<td class="org-right">152</td>
</tr>
<tr>
<td class="org-left">Cambridge</td>
<td class="org-right">0.423</td>
<td class="org-right">60</td>
<td class="org-right">25</td>
<td class="org-right">57</td>
</tr>
<tr>
<td class="org-left">Salk Institute</td>
<td class="org-right">0.407</td>
<td class="org-right">88</td>
<td class="org-right">24</td>
<td class="org-right">104</td>
</tr>
<tr>
<td class="org-left">MGH</td>
<td class="org-right">0.393</td>
<td class="org-right">22</td>
<td class="org-right">15</td>
<td class="org-right">19</td>
</tr>
<tr>
<td class="org-left">MIT</td>
<td class="org-right">0.392</td>
<td class="org-right">155</td>
<td class="org-right">37</td>
<td class="org-right">203</td>
</tr>
<tr>
<td class="org-left">UC Berkeley</td>
<td class="org-right">0.390</td>
<td class="org-right">120</td>
<td class="org-right">49</td>
<td class="org-right">139</td>
</tr>
<tr>
<td class="org-left">Johns Hopkins</td>
<td class="org-right">0.389</td>
<td class="org-right">65</td>
<td class="org-right">36</td>
<td class="org-right">66</td>
</tr>
<tr>
<td class="org-left">Yale School of Medicine</td>
<td class="org-right">0.387</td>
<td class="org-right">24</td>
<td class="org-right">18</td>
<td class="org-right">20</td>
</tr>
<tr>
<td class="org-left">Harvard Medical School</td>
<td class="org-right">0.374</td>
<td class="org-right">145</td>
<td class="org-right">59</td>
<td class="org-right">184</td>
</tr>
<tr>
<td class="org-left">Stanford</td>
<td class="org-right">0.372</td>
<td class="org-right">186</td>
<td class="org-right">62</td>
<td class="org-right">252</td>
</tr>
<tr>
<td class="org-left">NIH</td>
<td class="org-right">0.367</td>
<td class="org-right">66</td>
<td class="org-right">26</td>
<td class="org-right">88</td>
</tr>
<tr>
<td class="org-left">Carnegie Mellon</td>
<td class="org-right">0.362</td>
<td class="org-right">21</td>
<td class="org-right">14</td>
<td class="org-right">23</td>
</tr>
<tr>
<td class="org-left">UCSD</td>
<td class="org-right">0.359</td>
<td class="org-right">111</td>
<td class="org-right">68</td>
<td class="org-right">130</td>
</tr>
<tr>
<td class="org-left">Oxford</td>
<td class="org-right">0.358</td>
<td class="org-right">64</td>
<td class="org-right">51</td>
<td class="org-right">64</td>
</tr>
<tr>
<td class="org-left">University of Arizona</td>
<td class="org-right">0.348</td>
<td class="org-right">23</td>
<td class="org-right">21</td>
<td class="org-right">22</td>
</tr>
<tr>
<td class="org-left">CSHL</td>
<td class="org-right">0.347</td>
<td class="org-right">33</td>
<td class="org-right">13</td>
<td class="org-right">49</td>
</tr>
<tr>
<td class="org-left">CU Boulder</td>
<td class="org-right">0.333</td>
<td class="org-right">27</td>
<td class="org-right">20</td>
<td class="org-right">34</td>
</tr>
<tr>
<td class="org-left">UCSF</td>
<td class="org-right">0.333</td>
<td class="org-right">160</td>
<td class="org-right">58</td>
<td class="org-right">263</td>
</tr>
<tr>
<td class="org-left">Washington University</td>
<td class="org-right">0.331</td>
<td class="org-right">58</td>
<td class="org-right">38</td>
<td class="org-right">79</td>
</tr>
<tr>
<td class="org-left">UCL</td>
<td class="org-right">0.329</td>
<td class="org-right">92</td>
<td class="org-right">52</td>
<td class="org-right">136</td>
</tr>
<tr>
<td class="org-left">UVA</td>
<td class="org-right">0.328</td>
<td class="org-right">20</td>
<td class="org-right">20</td>
<td class="org-right">21</td>
</tr>
<tr>
<td class="org-left">Columbia</td>
<td class="org-right">0.323</td>
<td class="org-right">106</td>
<td class="org-right">52</td>
<td class="org-right">170</td>
</tr>
<tr>
<td class="org-left">Princeton</td>
<td class="org-right">0.308</td>
<td class="org-right">44</td>
<td class="org-right">25</td>
<td class="org-right">74</td>
</tr>
<tr>
<td class="org-left">Yale</td>
<td class="org-right">0.307</td>
<td class="org-right">95</td>
<td class="org-right">51</td>
<td class="org-right">163</td>
</tr>
<tr>
<td class="org-left">UW Madison</td>
<td class="org-right">0.300</td>
<td class="org-right">51</td>
<td class="org-right">50</td>
<td class="org-right">69</td>
</tr>
<tr>
<td class="org-left">University of Iowa</td>
<td class="org-right">0.296</td>
<td class="org-right">21</td>
<td class="org-right">28</td>
<td class="org-right">22</td>
</tr>
<tr>
<td class="org-left">UCLA</td>
<td class="org-right">0.294</td>
<td class="org-right">112</td>
<td class="org-right">76</td>
<td class="org-right">193</td>
</tr>
<tr>
<td class="org-left">NYU</td>
<td class="org-right">0.287</td>
<td class="org-right">64</td>
<td class="org-right">40</td>
<td class="org-right">119</td>
</tr>
<tr>
<td class="org-left">Cornell</td>
<td class="org-right">0.287</td>
<td class="org-right">35</td>
<td class="org-right">23</td>
<td class="org-right">64</td>
</tr>
<tr>
<td class="org-left">Vanderbilt</td>
<td class="org-right">0.287</td>
<td class="org-right">49</td>
<td class="org-right">45</td>
<td class="org-right">77</td>
</tr>
<tr>
<td class="org-left">UMN</td>
<td class="org-right">0.282</td>
<td class="org-right">31</td>
<td class="org-right">37</td>
<td class="org-right">42</td>
</tr>
<tr>
<td class="org-left">Brandeis</td>
<td class="org-right">0.282</td>
<td class="org-right">20</td>
<td class="org-right">13</td>
<td class="org-right">38</td>
</tr>
<tr>
<td class="org-left">University of Washington</td>
<td class="org-right">0.278</td>
<td class="org-right">79</td>
<td class="org-right">64</td>
<td class="org-right">141</td>
</tr>
<tr>
<td class="org-left">SUNY Stony Brook</td>
<td class="org-right">0.278</td>
<td class="org-right">20</td>
<td class="org-right">19</td>
<td class="org-right">33</td>
</tr>
<tr>
<td class="org-left">Rochester</td>
<td class="org-right">0.276</td>
<td class="org-right">35</td>
<td class="org-right">37</td>
<td class="org-right">55</td>
</tr>
<tr>
<td class="org-left">Rutgers</td>
<td class="org-right">0.276</td>
<td class="org-right">27</td>
<td class="org-right">25</td>
<td class="org-right">46</td>
</tr>
<tr>
<td class="org-left">UC Irvine</td>
<td class="org-right">0.273</td>
<td class="org-right">39</td>
<td class="org-right">34</td>
<td class="org-right">70</td>
</tr>
<tr>
<td class="org-left">Duke</td>
<td class="org-right">0.271</td>
<td class="org-right">61</td>
<td class="org-right">44</td>
<td class="org-right">120</td>
</tr>
<tr>
<td class="org-left">Baylor</td>
<td class="org-right">0.263</td>
<td class="org-right">46</td>
<td class="org-right">34</td>
<td class="org-right">95</td>
</tr>
<tr>
<td class="org-left">Johns Hopkins Medical School</td>
<td class="org-right">0.260</td>
<td class="org-right">45</td>
<td class="org-right">26</td>
<td class="org-right">102</td>
</tr>
<tr>
<td class="org-left">Indiana University</td>
<td class="org-right">0.250</td>
<td class="org-right">23</td>
<td class="org-right">24</td>
<td class="org-right">45</td>
</tr>
<tr>
<td class="org-left">Boston University</td>
<td class="org-right">0.243</td>
<td class="org-right">25</td>
<td class="org-right">30</td>
<td class="org-right">48</td>
</tr>
<tr>
<td class="org-left">Chicago</td>
<td class="org-right">0.239</td>
<td class="org-right">33</td>
<td class="org-right">40</td>
<td class="org-right">65</td>
</tr>
<tr>
<td class="org-left">Penn</td>
<td class="org-right">0.239</td>
<td class="org-right">78</td>
<td class="org-right">67</td>
<td class="org-right">182</td>
</tr>
<tr>
<td class="org-left">Brown</td>
<td class="org-right">0.232</td>
<td class="org-right">32</td>
<td class="org-right">41</td>
<td class="org-right">65</td>
</tr>
<tr>
<td class="org-left">OHSU</td>
<td class="org-right">0.231</td>
<td class="org-right">39</td>
<td class="org-right">34</td>
<td class="org-right">96</td>
</tr>
<tr>
<td class="org-left">University of Florida</td>
<td class="org-right">0.225</td>
<td class="org-right">20</td>
<td class="org-right">26</td>
<td class="org-right">43</td>
</tr>
<tr>
<td class="org-left">McGill</td>
<td class="org-right">0.219</td>
<td class="org-right">35</td>
<td class="org-right">44</td>
<td class="org-right">81</td>
</tr>
<tr>
<td class="org-left">UNC Chapel Hill</td>
<td class="org-right">0.212</td>
<td class="org-right">36</td>
<td class="org-right">43</td>
<td class="org-right">91</td>
</tr>
<tr>
<td class="org-left">Michigan, Ann Arbor</td>
<td class="org-right">0.200</td>
<td class="org-right">33</td>
<td class="org-right">55</td>
<td class="org-right">77</td>
</tr>
<tr>
<td class="org-left">University of Toronto</td>
<td class="org-right">0.191</td>
<td class="org-right">21</td>
<td class="org-right">44</td>
<td class="org-right">45</td>
</tr>
<tr>
<td class="org-left">UC Davis</td>
<td class="org-right">0.189</td>
<td class="org-right">32</td>
<td class="org-right">48</td>
<td class="org-right">89</td>
</tr>
<tr>
<td class="org-left">Northwestern</td>
<td class="org-right">0.173</td>
<td class="org-right">37</td>
<td class="org-right">48</td>
<td class="org-right">129</td>
</tr>
<tr>
<td class="org-left">University of Pittsburgh</td>
<td class="org-right">0.166</td>
<td class="org-right">35</td>
<td class="org-right">49</td>
<td class="org-right">127</td>
</tr>
<tr>
<td class="org-left">Emory</td>
<td class="org-right">0.145</td>
<td class="org-right">21</td>
<td class="org-right">42</td>
<td class="org-right">82</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>
